system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    inlet1.stl{type triSurfaceMesh; name inlet1;}
    outlet1.stl{type triSurfaceMesh; name outlet1;}
    slipwall1.stl{type triSurfaceMesh; name slipwall1;}
    symmetry1.stl{type triSurfaceMesh; name symmetry1;}
    symmetry2.stl{type triSurfaceMesh; name symmetry2;}
    hedge.stl{type triSurfaceMesh; name hedge;}
    refinebox.stl{type triSurfaceMesh; name refinebox;}
};

castellatedMeshControls
{
    features
    (
      { file "combined.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        hedge
        {
            level (2 6);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinebox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (0 0.5 0.5); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    true;
//  implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        "CAD.*"
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       true; // false, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
//  firstLayerThickness 0.01;

//  maxThicknessToMedialRatio 0.6;
}

meshQualityControls
{
//    minTetQuality -1e+30;
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
